In [1]:
import numpy as np 
import pandas as pd

## Step 1 : Read the data

In [2]:
df = pd.read_csv("Aerofit.csv")
df.head(5)

,Unnamed: 0,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
0,0,KP281,18,Male,14,Single,3,4,29562,112
1,1,KP281,19,Male,15,Single,2,3,31836,75
2,2,KP281,19,Female,14,Partnered,4,3,30699,66
3,3,KP281,19,Male,12,Single,3,3,32973,85
4,4,KP281,20,Male,13,Partnered,4,2,35247,47

## Step 2: Describing the Data

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     180 non-null    int64
 1   Product        180 non-null    object
 2   Age            180 non-null    int64
 3   Gender         180 non-null    object
 4   Education      180 non-null    int64
 5   MaritalStatus  180 non-null    object
 6   Usage          180 non-null    int64
 7   Fitness        180 non-null    int64
 8   Income         180 non-null    int64
 9   Miles          180 non-null    int64
dtypes: int64(7), object(3)
memory usage: 14.2+ KB

A cloumn name "unnmed" seems to be a bit odd, let us see if this column is an index(which it is in all probablity), if that is the case we can drop it. We will create a method for it there we will check if it matches the index of dataframe, if that is the case then we will drop it, else we need to keep it.

In [10]:
def drop_column(df: pd.DataFrame ,column_name: str) -> pd.DataFrame:

    if column_name in df.columns:

        if df[column_name].equals(df.index.to_series()):
            print(f"{column_name} matches the index, so we can drop it, and dropping it now")
            df = df.drop(columns=[column_name])
            return df
        else:
            print(f"{column_name} does not matches the index, so we can't drop it.")

    else:
        print(f"The {column_name} is not in dataframe")

In [11]:
df = drop_column(df=df, column_name= "Unnamed: 0")

Unnamed: 0 matches the index, so we can drop it, and dropping it now

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [28]:
df.size

1620

In [13]:
df.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [15]:
df.isna().sum()

Product          0
Age              0
Gender           0
Education        0
MaritalStatus    0
Usage            0
Fitness          0
Income           0
Miles            0
dtype: int64

In [23]:
categorical_cols = df.select_dtypes(include=['object'])

categorical_cols.nunique()

Product          3
Gender           2
MaritalStatus    2
dtype: int64

In [24]:
for col in categorical_cols:
    print(f"Column : {col}")
    print(f"Unique Values {col} column: {df[col].unique()}")
    print(f"Total number of unique values in {col} column: {df[col].nunique()} ")
    print("*"*50)

Column : Product
Unique Values Product column: ['KP281' 'KP481' 'KP781']
Total number of unique values in Product column: 3
**************************************************
Column : Gender
Unique Values Gender column: ['Male' 'Female']
Total number of unique values in Gender column: 2
**************************************************
Column : MaritalStatus
Unique Values MaritalStatus column: ['Single' 'Partnered']
Total number of unique values in MaritalStatus column: 2
**************************************************